lxf13927043839/Stm32_code/bluetooth/USER/main.c
void ADJUST_time(u8 option,u8 shanshuo)
{
		if(shanshuo%50==0)  //提示现在要设置的选项
		{
		  LCD_DisplayString_color(30,280,24,"Please Set          ",BLUE,WHITE);
		  LCD_DisplayString_color(162,280,24,(u8 *)set_option[option],BLUE,WHITE);
		}
		
		//设置时数值的加减1
		if( (keydown_data==KEY0_DATA)||(keydown_data==KEY1_DATA))
		{
		  if(keydown_data==KEY0_DATA)
			{
			  switch(option)
				{
				  case 0: RTC_DateStruct.RTC_Year+=1;   break;
					case 1:
								if(RTC_DateStruct.RTC_Month==12)
								{
									RTC_DateStruct.RTC_Month=1;
								}
								else
								RTC_DateStruct.RTC_Month+=1;  
								break;
					case 2: 
								if(RTC_DateStruct.RTC_Date==28&&RTC_DateStruct.RTC_Month==2&&RTC_DateStruct.RTC_Year%4!=0)
								{
									RTC_DateStruct.RTC_Date=1;
								}
								else if(RTC_DateStruct.RTC_Date==29&&RTC_DateStruct.RTC_Month==2&&RTC_DateStruct.RTC_Year%4==0)
								{
									RTC_DateStruct.RTC_Date=1;
								}
								else if(RTC_DateStruct.RTC_Date==30)
								{
									switch(RTC_DateStruct.RTC_Month)
									{
										case 4:
										case 6:
										case 9:
										case 11:
														RTC_DateStruct.RTC_Date=1;
														break;
										case 1:
										case 3:
										case 5:
										case 7:
										case 8:
										case 10:
										case 12:
														RTC_DateStruct.RTC_Date+=1;
														break;
									}
								}
								else if(RTC_DateStruct.RTC_Date==31)
								{
									RTC_DateStruct.RTC_Date=1;
								}
								else
								RTC_DateStruct.RTC_Date+=1;   
								break;
					case 3: 
								if(RTC_TimeStruct.RTC_Hours==23)
								{
									RTC_TimeStruct.RTC_Hours=0;
								}
								else
								RTC_TimeStruct.RTC_Hours+=1;  
								break;
					case 4: 
								if(RTC_TimeStruct.RTC_Minutes==59)
								{
									RTC_TimeStruct.RTC_Minutes=0;
								}
								else
								RTC_TimeStruct.RTC_Minutes+=1;
								break;
					case 5: 
								if(RTC_TimeStruct.RTC_Seconds==59)
								{
									RTC_TimeStruct.RTC_Seconds=0;
								}
								else
								RTC_TimeStruct.RTC_Seconds+=1;
								break;
				}	
			}
			if(keydown_data==KEY1_DATA)
			{
			  switch(option)
				{
				  case 0: RTC_DateStruct.RTC_Year-=1; break;
					case 1: 
								if(RTC_DateStruct.RTC_Month==1)
								{
									RTC_DateStruct.RTC_Month=12;
								}
								else
								RTC_DateStruct.RTC_Month-=1;
								break;
					case 2: 
								if(RTC_DateStruct.RTC_Date==1)
								{
									if((RTC_DateStruct.RTC_Year)%4==0&&(RTC_DateStruct.RTC_Month)==2)
									{
										RTC_DateStruct.RTC_Date=29;
									}
									else
									{
										if((RTC_DateStruct.RTC_Month)==2)
										{
											RTC_DateStruct.RTC_Date=28;
										}
										else
										{
											switch((RTC_DateStruct.RTC_Month))
											{
												case 1:
												case 3:
												case 5:
												case 7:
												case 8:
												case 10:
												case 12:
																RTC_DateStruct.RTC_Date=31;
												break;
												
												case 4:
												case 6:
												case 9:
												case 11:
																RTC_DateStruct.RTC_Date=30;
												break;
											}
										}
									}
								}
								else								
								RTC_DateStruct.RTC_Date-=1;//考虑到
							
								break;
					case 3: 
								if(RTC_TimeStruct.RTC_Hours==0)
								{
									RTC_TimeStruct.RTC_Hours=23;
								}
								else
								RTC_TimeStruct.RTC_Hours-=1;
							
								break;
					case 4: 
								if(RTC_TimeStruct.RTC_Hours==0)
								{
									RTC_TimeStruct.RTC_Minutes=59;
								}
								else
								RTC_TimeStruct.RTC_Minutes-=1;
								break;
					case 5: 
								if(RTC_TimeStruct.RTC_Seconds==0)
								{
									RTC_TimeStruct.RTC_Seconds=59;
								}
								else
								RTC_TimeStruct.RTC_Seconds-=1;
								break;
				}	
			}
		}
		//闪烁显示：显示
	if(shanshuo==150)
	{
			Time_Display();
//			LCD_DisplayNum(86,220,RTC_DateStruct.RTC_Year,2,16,1);
//			LCD_DisplayNum(110,220,RTC_DateStruct.RTC_Month,2,16,1);
//			LCD_DisplayNum(134,220,RTC_DateStruct.RTC_Date,2,16,1);
//			LCD_DisplayNum(70,240,RTC_TimeStruct.RTC_Hours,2,16,1);
//			LCD_DisplayNum(94,240,RTC_TimeStruct.RTC_Minutes,2,16,1);
//			LCD_DisplayNum(118,240,RTC_TimeStruct.RTC_Seconds,2,16,1);
	}	
		//闪烁显示：不显示
	switch(option)
	{  
		case 0: {  if(shanshuo==49)  LCD_DisplayString(114,220,24,"  ");	 break;  }
		case 1: {  if(shanshuo==49)  LCD_DisplayString(150,220,24,"  "); break;  }
		case 2: {  if(shanshuo==49)  LCD_DisplayString(186,220,24,"  "); break;  }
		case 3: {  if(shanshuo==49)  LCD_DisplayString(90,250,24,"  ");  break;  }
		case 4: {  if(shanshuo==49)	 LCD_DisplayString(126,250,24,"  ");	 break;	 }
		case 5: {  if(shanshuo==49)	 LCD_DisplayString(162,250,24,"  "); break;  }		
	}
}	

u8 enter_set_time=0;
void SET_time(void)
{
	//注：有一些函数是初始化过了的，整合时候要删除
	
	u8 process=0;  //程序流程走向
	u8 option=6;     //调整时间选项
	u8 t=0,j;      //计时参数
	u8 time_set_flag=0;//是否设置了按键的定时标志
	u8 now_date_buff[40];//当前的日期
	u8 now_time_buff[40];//当前的时间

	u8 time_buff[40]={0};//存放定时的时间,没有初始化会出现一些意外的bug，如出现一斜杆
	u8 date_buff[40];//存放定时的日期
	u8 test[40];//从24c02 读取数据测试
	u8 curtain_status=3;//窗帘状态,只有0/1 状态是有效的，其他数字是无效的
	short set_tim_success=-1; //时间的设置是正常的 
	u8 had_settimeflag=3; //检测是否有设置了
	u8 temp;
	u8 set_curtain_status;//
	/*
	char temp[]="20200215";
	char temp1[]="20200315";
	
	ret=Judge_correct_time(temp1,temp);
	printf("ret = %d\n",ret);
	*/ 
	
	/*
	//NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);//设置系统中断优先级分组2
	//Systick_init(168);         //初始化延时函数
	//UART1_init(115200);
	
	//LED_init();					  //初始化LED
 	//LCD_init();					  //初始化LCD
	//KEY_init();           //初始化KEY
  */
	BRUSH_COLOR=RED;
	
	//待删除部分
	/*
	LCD_DisplayString(10,10,24,"Illuminati STM32F4");	
	LCD_DisplayString(10,40,16,"Author:Clever");
	LCD_DisplayString(30,70,24,"14.RTC TEST");
	LCD_DisplayString(30,100,16,"KEY3 Long :Adjust time");
	LCD_DisplayString(30,120,16,"     Short:Adjust OK");
	LCD_DisplayString(30,140,16,"KEY0: V++  KEY1: V--");
	LCD_DisplayString(30,160,16,"KEY2: Right Move");
	*/
	RTC_GetTimes(RTC_Format_BIN);//获得系统的时间
	Time_Display(); //在底下进行的动态显示
	

	//显示界面
	
	image_display(0,0,(u8*)gImage_set_time);
	
